In [1]:
import pandas as pd

In [3]:
dict1={'Name':['Priyang','Aadhya','krisha','Vedant','Parshov','Mittal','Archana'],
       'Marks':[98,89,99,87,90,83,99],
       'Gender':['Male','Female','Female','Male','Male','Female','Female'],
       }

In [7]:
df1=pd.DataFrame(dict1)
print(df1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   krisha     99  Female
3   Vedant     87    Male
4  Parshov     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [ ]:
df1.head()# shows first 5 rows

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   krisha     99  Female
3   Vedant     87    Male
4  Parshov     90    Male

In [ ]:
df1.tail() # shows first 10 rows

      Name  Marks  Gender
2   krisha     99  Female
3   Vedant     87    Male
4  Parshov     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [14]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [15]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   krisha     99  Female
4  Parshov     90    Male
6  Archana     99  Female

*Apply Method*

In [22]:
def marks(x):
    return x/2

In [29]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [30]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4  Parshov     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [31]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

*Map Function*

In [33]:
df1['Gender'].map({'Male':0,'Female':1})

0    0
1    1
2    1
3    0
4    0
5    1
6    1
Name: Gender, dtype: int64

In [34]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_marks'], dtype='object')

In [35]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [37]:
df1.sort_values(by='Marks')

      Name  Marks  Gender  Half_marks
5   Mittal     83  Female        41.5
3   Vedant     87    Male        43.5
1   Aadhya     89  Female        44.5
4  Parshov     90    Male        45.0
0  Priyang     98    Male        49.0
2   krisha     99  Female        49.5
6  Archana     99  Female        49.5

In [38]:
df1.sort_values(by='Gender')

      Name  Marks  Gender  Half_marks
1   Aadhya     89  Female        44.5
2   krisha     99  Female        49.5
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5
0  Priyang     98    Male        49.0
3   Vedant     87    Male        43.5
4  Parshov     90    Male        45.0

In [41]:
df1.sort_values(by=['Gender','Marks'], ascending=True)

      Name  Marks  Gender  Half_marks
5   Mittal     83  Female        41.5
1   Aadhya     89  Female        44.5
2   krisha     99  Female        49.5
6  Archana     99  Female        49.5
3   Vedant     87    Male        43.5
4  Parshov     90    Male        45.0
0  Priyang     98    Male        49.0

In [1]:
import pandas as pd